Repository: nasralbek/sosavpnbot
Catalog: locales/*/LC_MESSAGES/bot.po
Languages: ru

# main_menu:message:main
source: ▫️ <b>Subscription:</b> <code>{status}</code> ▫️ <b>Until:</b> <code>{balance}</code>
ru: ▫️ <b>Подписка:</b> <code>{status}</code> ▫️ <b>До:</b> <code>{balance}</code>

# main_menu:message:new_user
source: <b>🎁 Your 3-day free trial has been activated!</b>
ru: <b>🎁 Активировали вам пробную подписку на 3 дня!</b>

# maintenance:ntf:try_later
source: 🚧 <i>The bot is currently under maintenance. Please try again later.</i>
ru: 🚧 <i>Бот находится в режиме обслуживания. Пожалуйста, попробуйте позже.</i>

# main_menu:button:main
source: 🏠 Main Menu
ru: 🏠 Главное меню

# main_menu:button:profile
source: ⚙️ Connect VPN
ru: ⚙️ Подключить VPN

# main_menu:button:invite_friend
source: 👥 Invite
ru: 👥 Пригласить

# main_menu:button:support
source: 👩‍💻 Support
ru: 👩‍💻 Поддержка

# main_menu:button:admin
source: 🛠️ Admin Panel
ru: !!!админка228

# main_menu:button:purshare
source: 💸 Extend Subscription
ru: 💸 Продлить подписку

# main_menu:button:polite
source: 🌑 About Us
ru: 🌑 О сервисе

# purshare:message:main
source: <b>⚡️ Select a renewal period:</b>
ru: <b>⚡️ Выберите срок продления:</b>

# connect:message:main
source: <b>⚡️ Select your device:</b>
ru: <b>⚡️ Выберите ваше устройство:</b>

# how_to:button:add
source: ⚙️ Add Config
ru: ⚙️ Добавить

# how_to:button:download
source: ☁️ Download
ru: ☁️ Скачать

# how_to:button:download_apple
source: ☁️ Download [RU]
ru: ☁️ Скачать [RU]

# how_to:button:download_apple_alt
source: ☁️ Download [GLOBAL]
ru: ☁️ Скачать [GLOBAL]

# invite:message:main
source: <b>▫️ Get 1 day</b> for every friend you invite <b>▫️ Get 20%</b> of your friends' payments <b>👥 Invited:</b> <code>{invited_count} people</code> <b>🔗 Your referral link:</b> <code>{invite_link}</code>
ru: <b>▫️ 1 день —</b> за каждого приглашённого <b>▫️ 20%</b> с пополнений ваших друзей <b>👥 Приглашено:</b> <code>{invited_count} чел.</code> <b>🔗 Ваша ссылка:</b> <code>{invite_link}</code>

# select_method:message:main
source: <b>⏱️ Period:</b> <code>{days} days</code> <b>💸 Price:</b> <code>{price}₽</code> <b>⚡️ Select a payment method:</b>
ru: <b>⏱️ Срок:</b> <code>{days} дней</code> <b>💸 Стоимость:</b> <code>{price}₽</code> <b>⚡️ Выберите способ оплаты:</b>

# purschare_final:message:main
source: <b>⏱️ Period:</b> <code>{days} days</code> <b>💸 Price:</b> <code>{price}₽</code> <b>💳 Payment Method:</b> <code>{method}</code> <b>⚡️ Proceed to payment using the button below:</b>
ru: <b>⏱️ Срок:</b> <code>{days} дней</code> <b>💸 Стоимость:</b> <code>{price}₽</code> <b>💳 Способ оплаты:</b> <code>{method}</code> <b>⚡️ Перейдите к оплате по кнопке ниже:</b>

# purschare_final:button:pay
source: 🔗 Proceed to Payment
ru: 🔗 Перейти к оплате

# how_to:platform:message:IOS
source: <b>📖 To connect to the VPN on iOS:</b> <b>1.</b> Press the <b>'☁️ Download'</b> button to get the app from the App Store. <b>2.</b> Press the <b>'⚙️ Add Config'</b> button to add the configuration to the app.
ru: <b>📖 Для подключения VPN на iOS:</b> <b>1.</b> Нажмите кнопку <b>«☁️ Скачать»</b>, чтобы скачать приложение из App Store. <b>2.</b> Нажмите кнопку <b>«⚙️ Добавить»</b>, чтобы добавить конфигурацию в приложение.

# how_to:platform:message:ANDROID
source: <b>📖 To connect to the VPN on Android:</b> <b>1.</b> Press the <b>'☁️ Download'</b> button to get the app from Google Play. <b>2.</b> Press the <b>'⚙️ Add Config'</b> button to add the configuration to the app.
ru: <b>📖 Для подключения VPN на Android:</b> <b>1.</b> Нажмите кнопку <b>«☁️ Скачать»</b>, чтобы скачать приложение из Google Play. <b>2.</b> Нажмите кнопку <b>«⚙️ Добавить»</b>, чтобы добавить конфигурацию в приложение.

# how_to:platform:message:WINDOWS
source: <b>📖 To connect to the VPN on Windows:</b> <b>1.</b> Click the <b>'☁️ Download'</b> button to get the app. <b>2.</b> Click the <b>'⚙️ Add Config'</b> button to add the configuration to the app.
ru: <b>📖 Для подключения VPN на Windows:</b> <b>1.</b> Нажмите кнопку <b>«☁️ Скачать»</b>, чтобы скачать приложение. <b>2.</b> Нажмите кнопку <b>«⚙️ Добавить»</b>, чтобы добавить конфигурацию в приложение.

# how_to:platform:message:MACOS
source: <b>📖 To connect to the VPN on macOS:</b> <b>1.</b> Click the <b>'☁️ Download'</b> button to get the app from the App Store. <b>2.</b> Click the <b>'⚙️ Add Config'</b> button to add the configuration to the app.
ru: <b>📖 Для подключения VPN на macOS:</b> <b>1.</b> Нажмите кнопку <b>«☁️ Скачать»</b>, чтобы скачать приложение из App Store. <b>2.</b> Нажмите кнопку <b>«⚙️ Добавить»</b>, чтобы добавить конфигурацию в приложение.

# how_to:platform:message:ANDROIDTV
source: <b>📖 To connect to the VPN on Android TV:</b> <b>1.</b> Press the <b>'☁️ Download'</b> button to get the app from Google Play. <b>2.</b> Press the <b>'⚙️ Add Config'</b> button to add the configuration to the app.
ru: <b>📖 Для подключения VPN на Android TV:</b> <b>1.</b> Нажмите кнопку <b>«☁️ Скачать»</b>, чтобы скачать приложение из Google Play. <b>2.</b> Нажмите кнопку <b>«⚙️ Добавить»</b>, чтобы добавить конфигурацию в приложение.

# how_to:platform:message:LINUX
source: <b>📖 To connect to the VPN on Linux:</b> <b>1.</b> Click the <b>'☁️ Download'</b> button to get the app. <b>2.</b> Click the <b>'⚙️ Add Config'</b> button to add the configuration to the app.
ru: <b>📖 Для подключения VPN на Linux:</b> <b>1.</b> Нажмите кнопку <b>«☁️ Скачать»</b>, чтобы скачать приложение. <b>2.</b> Нажмите кнопку <b>«⚙️ Добавить»</b>, чтобы добавить конфигурацию в приложение.

# purchare:message:success
source: <b>⚡️ Your subscription has been extended by</b> <code>{days} days</code>.
ru: <b>⚡️ Ваша подписка продлена на</b> <code>{days} дней</code>.

# expire:message:expired_day_ago
source: <b>⚠️ Your subscription expired yesterday.</b> To get the VPN working again, please extend your subscription using the button below.
ru: <b>⚠️ Ваша подписка истекла вчера.</b> Чтобы VPN снова заработал, продлите подписку по кнопке ниже.

# expire:message:expired
source: <b>⚠️ Your subscription has expired.</b> To get the VPN working again, please extend your subscription using the button below.
ru: <b>⚠️ Ваша подписка истекла.</b> Чтобы VPN снова заработал, продлите подписку по кнопке ниже.

# expire:message:will_expire
source: <b>⚠️ Your subscription will expire in</b> <code>{days} days</code>. To maintain access to the VPN, please extend your subscription using the button below.
ru: <b>⚠️ Ваша подписка истечет через</b> <code>{days} дней</code>. Чтобы сохранить доступ к VPN, продлите подписку по кнопке ниже.

# notify:message:payment_from_ref
source: <b>⚡️ Your subscription has been extended by</b> <code>{days} days</code> <b>thanks to your friend's payment.</b>
ru: <b>⚡️ Ваша подписка продлена на</b> <code>{days} дней</code> <b>за оплату вашего друга</b>.

# notify:message:registered_by_ref
source: <b>⚡️ Your subscription has been extended by</b> <code>{days} day</code> <b>for your friend's registration.</b>
ru: <b>⚡️ Ваша подписка продлена на</b> <code>{days} день</code> <b>за регистрацию вашего друга</b>.

# notify:message:pizdaliz
source: <b>⚡️ Your subscription has been extended by</b> <code>{days} days</code> <b>as a bonus!</b>
ru: <b>⚡️ Ваша подписка продлена на</b> <code>{days} дней</code>, <b>чтобы привлечь ваше внимание</b>.

# select_plan:button:text
source: {days} days - {price}₽
ru: {days} дней — {price}₽

# notify:message:first_connected
source: <b>You have successfully connected to the VPN. Enjoy!</b> You can manage your subscription and connect other devices from the main menu using the button below.
ru: <b>Вы успешно подключили VPN, приятного использования!</b> Управление подпиской и подключение других устройств доступно через главное меню по кнопке ниже.

# purschare:method:pay_pally
source: 🇷🇺 Bank Card
ru: 🇷🇺 Банковская карта

# purschare:method:pay_heleket
source: 🌍 Cryptocurrency
ru: 🌍 Криптовалюта

# polite:button:polite
source: Privacy Policy
ru: Политика конфиденциальности

# polite:button:rules
source: Terms of Service
ru: Пользовательское соглашение

# polite:message:main
source: Sosa VPN uses an open-source protocol that offers superior performance compared to others. All our servers are equipped with 10 Gbps channels. Logs are instantly deleted from our servers; we do not store your browsing history, unlike many free services. We do not collect or sell any of your personal data. Access to the VPN is managed via Telegram, which means our service cannot be blocked or removed from the App Store or other platforms.
ru: Sosa VPN использует протокол с открытым исходным кодом, который имеет наилучшую производительность, по сравнению с другими. Все наши сервера оснащены каналом 10 гбит/с. Журнал логов удаляется с наших серверов моментально, мы не храним историю посещений, в отличии от многих бесплатных сервисов. Мы не собираем и не продаём какие либо данные о Вас. Для выдачи доступа к VPN используется Telegram, в связи с этим нас невозможно заблокировать или удалить из App Store и других площадок.

# main_menu:status:active
source: Active ⚡️
ru: Активна ⚡️

# main_menu:status:inactive
source: Expired ⚠️
ru: Истекла ⚠️

# support:message:main
source: <b>Do you have any questions or need assistance?</b> Check out our <a href="https://telegra.ph/Knowledge-Base-09-02">knowledge base</a>, where you will likely find a solution to your problem, or use the button below to contact us.
ru: <b>У вас есть вопросы или вам нужна помощь?</b> Ознакомьтесь с нашей <a href="https://telegra.ph/Baza-znanij-09-02">базой знаний</a>, скорее всего там есть решение вашей проблемы, или воспользуйтесь кнопкой ниже, чтобы связаться с нами.

# support:button:get_support
source: 👋 Contact Us
ru: 👋 Связаться с нами

# month:january
source: January
ru: января

# month:february
source: February
ru: февраля

# month:march
source: March
ru: марта

# month:april
source: April
ru: апреля

# month:may
source: May
ru: мая

# month:june
source: June
ru: июня

# month:july
source: July
ru: июля

# month:august
source: August
ru: августа

# month:september
source: September
ru: сентября

# month:october
source: October
ru: октября

# month:november
source: November
ru: ноября

# month:december
source: December
ru: декабря
