# Используем базовый образ Python, соответствующий вашей версии (Python 3.13)
FROM python:3.13-slim-bookworm

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл зависимостей и устанавливаем их
# Это позволяет Docker кэшировать этот слой, ускоряя пересборку
COPY requierments.txt .
RUN pip install --no-cache-dir -r requierments.txt

COPY .env .

# Копируем весь остальной код вашего бота в контейнер
# Предполагается, что main.py находится прямо в /opt/bot/sosavpnbot/
COPY . .

# Указываем, что приложение внутри контейнера будет слушать на порту 2225
EXPOSE 2225

# Команда, которая запускается при старте контейнера
CMD ["python", "main.py"]
