how_ios = ("📱 <b>Инструкция для iOS</b>:\n"
            "1. Установи Hiddify из App Store.\n"
            "2. Открой приложение и нажми “+”.\n"
            "3. Выбери “Импорт из текста”.\n"
            "4. Вставь ключ и нажми “Сохранить”.\n"
            "5. Нажми “Подключиться”.")

how_android =   ("🤖 <b>Инструкция для Android</b>:\n"
                "1. Установи Hiddify из Google Play или с сайта hiddify.com.\n"
                "2. Открой приложение и нажми “+”.\n"
                "3. Выбери “Импорт из текста”.\n"
                "4. Вставь ключ и нажми “Сохранить”.\n"
                "5. Нажми “Старт” для подключения.")

how_windows =   ("🪟 <b>Инструкция для Windows</b>:\n"
                "1. Скачай Hiddify с сайта hiddify.com.\n"
                "2. Установи и открой программу.\n"
                "3. Нажми “Импорт → Из текста”.\n"
                "4. Вставь ключ и нажми “Импортировать”.\n"
                "5. Нажми “Подключиться”.")

how_macos = ("💻 <b>Инструкция для MacOS</b>:\n"
                "1. Установи Hiddify с сайта hiddify.com.\n"
                "2. Открой и нажми “+”.\n"
                "3. Выбери “Импорт из текста”.\n"
                "4. Вставь ключ и нажми “Добавить”.\n"
                "5. Нажми “Старт” для подключения.")


info = ("Sosa VPN использует протокол с открытым исходным кодом, который имеет наилучшую производительность, "
        "по сравнению с другими. Все наши сервера оснащены каналом 1 гбит/с.\n\n"
        "Журнал логов удаляется с наших серверов моментально, мы не храним историю посещений, в отличии от многих "
        "бесплатных сервисов. Мы не собираем и не продаём какие либо данные о Вас.\n\n"
        "Для выдачи доступа к VPN используется Telegram, в связи с этим нас не возможно заблокировать или удалить "
        "из App Store и других площадок.")

welcome_text = ("Я Ваш личный бот и помощник Sosa VPN!\n\n"
                "Я помогаю c обходом блокировок и защитой вашей конфиденциальности.\n\n"
                "Для использования сервиса Вам не нужно нигде регистрироваться, просто оплатите подписку и начните пользоваться VPN.\n"
                "Все происходит внутри Telegram.")